tap 'homebrew/bundle'

brew 'ag'
brew 'autoconf'
brew 'bazel'
brew 'checkbashisms'
brew 'cmake'
brew 'coreutils'
brew 'cowsay'
brew 'ctags'
brew 'dep'
brew 'direnv'
brew 'doxygen'
brew 'ffmpeg'
brew 'figlet'
brew 'fontconfig'
brew 'fontforge'
brew 'gawk'
brew 'gcc'
brew 'git'
brew 'glib'
brew 'go', args: ['cross-compile-common']
brew 'graphviz'
brew 'htop', args: ['with-ncurses']
brew 'hub'
brew 'imagemagick'
brew 'jq'
brew 'lame'
brew 'llvm' args: ['with-clang']
brew 'mariadb'
brew 'mecab'
brew 'mecab-ipaidc'
brew 'neovim'
brew 'nkf'
brew 'nmap'
brew 'node'
brew 'nodebrew'
brew 'opencv3'
brew 'openssl'
brew 'pkg-config'
brew 'protobuf'
brew 'python3'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ripgrep-bin'
brew 'ruby-build'
brew 'rust'
brew 'shellcheck'
brew 'sqlite'
brew 'swig'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tig', args: ['with-docs']
brew 'tmux'
brew 'tree'
brew 'w3m'
brew 'wget'
brew 'zsh', args: ['disable-etcdir']
brew 'zsh-completions'

tap 'caskroom/cask'
cask 'appcleaner'
cask 'dash'
cask 'flashlight'
cask 'google-japanese-ime'
cask 'mactex'
cask 'skype'
cask 'the-unarchiver'
cask 'xquartz'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'

