tap 'homebrew/bundle'

brew 'ag'
brew 'autoconf'
brew 'bazel'
brew 'checkbashisms'
brew 'cmake'
brew 'coreutils'
brew 'cowsay'
brew 'ctags'
brew 'direnv'
brew 'ffmpeg'
brew 'figlet'
brew 'fzf'
brew 'gawk'
brew 'git'
brew 'go', args: ['cross-compile-common']
brew 'htop', args: ['with-ncurses']
brew 'hub'
brew 'jq'
brew 'lame'
brew 'llvm' args: ['with-clang']
brew 'nkf'
brew 'node.js'
brew 'nodebrew'
brew 'opencv3'
brew 'openssl'
brew 'peco'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ruby-build'
brew 'shellcheck'
brew 'swig'
brew 'sqlite'
brew 'terminal-notifier'
brew 'tig', args: ['with-docs']
brew 'tmux'
brew 'tree'
brew 'vim', args: ['with-lua', 'with-luajit']
brew 'wget'
brew 'zsh', args: ['disable-etcdir']
brew 'zsh-completions'

tap 'neovim/neovim'
brew 'neovim'

tap 'caskroom/cask'
cask 'amethyst'
cask 'appcleaner'
cask 'bettertouchtool'
cask 'dash'
cask 'firefox'
cask 'flashlight'
cask 'google-japanese-ime'
cask 'karabiner'
#cask 'kobito'
cask 'mactex'
cask 'macvim'
cask 'nosleep'
cask 'skitch'
cask 'skype'
cask 'the-unarchiver'
cask 'xquartz'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'

